app/controllers/nabaztags_controller.rb

SELECT * FROM "nabaztags"
---
  def index
    @nabaztags = Nabaztag.all

SELECT * FROM "nabaztags" WHERE ("nabaztags"."id" = 1)
---
  def show
    @nabaztag = Nabaztag.find(params[:id])

SELECT * FROM "nabaztags" WHERE ("nabaztags"."id" = 1)
---
  def edit
    @nabaztag = Nabaztag.find(params[:id])

INSERT INTO "nabaztags" ("name", "updated_at", "token", "serial_number", "created_at") VALUES('yoghi', '2010-01-06 19:09:41', '1200561283', '0019DB9E934F', '2010-01-06 19:09:41')
---
  def create
    @nabaztag = Nabaztag.new(params[:nabaztag])

    respond_to do |format|
      if @nabaztag.save

SELECT * FROM "nabaztags" WHERE ("nabaztags"."id" = 1)
UPDATE "nabaztags" SET "token" = 'pj', "serial_number" = 'iiii', "updated_at" = '2010-01-16 20:26:15' WHERE "id" = 1
---
  def update
    @nabaztag = Nabaztag.find(params[:id])

    respond_to do |format|
      if @nabaztag.update_attributes(params[:nabaztag])

SELECT * FROM "nabaztags" WHERE ("nabaztags"."id" = 1)
---
  def sleep
    Nabaztag.find(params[:id]).sleep!

SELECT * FROM "nabaztags" WHERE ("nabaztags"."id" = 1)
---
  def wakeup
    Nabaztag.find(params[:id]).wakeup!

SELECT * FROM "radios" WHERE ("radios"."id" = 1)
SELECT * FROM "nabaztags" WHERE ("nabaztags"."id" = 1)
---
  def listen
    @radio=Radio.find(params[:radio])
    Nabaztag.find(params[:id]).listen_radio(Radio.find(params[:radio]))