app/controllers/radios_controller.rb

  def index
    @radios = Radio.all
---
SELECT * FROM "radios"

  def show
    @radio = Radio.find(params[:id])
---
SELECT * FROM "radios" WHERE ("radios"."id" = 1)

  def edit
    @radio = Radio.find(params[:id])
---
SELECT * FROM "radios" WHERE ("radios"."id" = 1)

  def create
    @radio = Radio.new(params[:radio])

    respond_to do |format|
      if @radio.save
---
INSERT INTO "radios" ("name", "updated_at", "url", "created_at") VALUES('ation: FM Tango Junin Argentina', '2010-01-06 19:12:42', '', '2010-01-06 19:12:42')

  def update
    @radio = Radio.find(params[:id])

    respond_to do |format|
      if @radio.update_attributes(params[:radio])
---
SELECT * FROM "radios" WHERE ("radios"."id" = 1)
UPDATE "radios" SET "url" = 'http://200.58.116.222:10580', "name" = 'FM Tango Junin Argentina', "updated_at" = '2010-01-06 19:13:04' WHERE "id" = 1